def f_ana_two_three(leaf_num, disc1, disc2):
    """
    计算f_ana_two_three的值。
    
    参数:
        leaf_num (float): 叶子数量。
        disc1 (float): 第一个输入值。
        disc2 (float): 第二个输入值。
    
    返回:
        float: 计算的结果值。
    """
    N = leaf_num
    # 计算f1
    f1 = 72 * N * (-7 + 12 * N) * (2 + 23 * N + 14 * N**2) * (11 + 67 * N + 38 * N**2)
    # 计算f2
    f2 = 2 * (132 + 490 * N - 25904 * N**2 - 129050 * N**3 + 13111 * N**4 + 148723 * N**5 + 60358 * N**6)
    # 计算f3
    f3 = -132 - 4522 * N - 39976 * N**2 - 102631 * N**3 + 35003 * N**4 + 131174 * N**5 + 48944 * N**6
    # 计算f4
    f4 = 12 * N * (-42 - 1211 * N - 8364 * N**2 - 1155 * N**3 + 7496 * N**4 + 3276 * N**5)
    # 计算f5
    f5 = 2 * (-66 - 2135 * N - 15332 * N**2 - 22319 * N**3 + 8416 * N**4 + 23404 * N**5 + 8032 * N**6)
    # 返回计算结果
    return f1 / (f2 + disc1 * f3 + disc2 * f4 + disc2**2 * f5)

"""
原Matlab代码中涉及到索引的需注意，Python索引从0开始，matlab索引从1开始
function val = f_ana_two_three(leaf_num, disc1, disc2)
N = leaf_num;
f1 = 72 *N *(-7+12 *N) *(2+23 *N+14 *N^2) *(11+67 *N+38 *N^2);
f2 = 2 * (132+490 *N-25904 *N^2-129050 *N^3+13111 *N^4+148723 *N^5+60358 *N^6);
f3 = -132-4522 *N-39976 *N^2-102631 *N^3+35003 *N^4+131174 *N^5+48944 *N^6;
f4 = 12 * N * (-42-1211 *N-8364 *N^2-1155 *N^3+7496 *N^4+3276 *N^5);
f5 = 2 * (-66-2135 *N-15332 *N^2-22319 *N^3+8416 *N^4+23404 *N^5+8032 *N^6);
val = f1 / (f2 + disc1*f3 + disc2*f4 + disc2^2*f5);
"""